In [1]:
import pandas as pd
df = pd.read_csv('사원별판매현황_홍길동.csv' , encoding='cp949')
df

    이름   요일   실적
0  홍길동  월요일  100
1  홍길동  화요일   70
2  홍길동  수요일   80
3  홍길동  목요일   85
4  홍길동  금요일   65
5  홍길동  토요일   95
6  홍길동  일요일  120

In [2]:
df.loc[1]

이름    홍길동
요일    화요일
실적     70
Name: 1, dtype: object

In [4]:
df.iloc[1]

이름    홍길동
요일    화요일
실적     70
Name: 1, dtype: object

In [7]:
df.loc[[1,3]]

    이름   요일  실적
1  홍길동  화요일  70
3  홍길동  목요일  85

In [8]:
df.iloc[[1,3]]

    이름   요일  실적
1  홍길동  화요일  70
3  홍길동  목요일  85

In [9]:
df.loc[1:3]

    이름   요일  실적
1  홍길동  화요일  70
2  홍길동  수요일  80
3  홍길동  목요일  85

In [11]:
df.iloc[1:4]

    이름   요일  실적
1  홍길동  화요일  70
2  홍길동  수요일  80
3  홍길동  목요일  85

In [12]:
df.loc[0:3]

    이름   요일   실적
0  홍길동  월요일  100
1  홍길동  화요일   70
2  홍길동  수요일   80
3  홍길동  목요일   85

In [13]:
df.iloc[0:4]

    이름   요일   실적
0  홍길동  월요일  100
1  홍길동  화요일   70
2  홍길동  수요일   80
3  홍길동  목요일   85

In [19]:
df.loc[:, ['이름']]

    이름
0  홍길동
1  홍길동
2  홍길동
3  홍길동
4  홍길동
5  홍길동
6  홍길동

In [26]:
df['이름']

0    홍길동
1    홍길동
2    홍길동
3    홍길동
4    홍길동
5    홍길동
6    홍길동
Name: 이름, dtype: object

In [20]:
df.loc[:, ['이름', '실적']]

    이름   실적
0  홍길동  100
1  홍길동   70
2  홍길동   80
3  홍길동   85
4  홍길동   65
5  홍길동   95
6  홍길동  120

In [25]:
df.loc[:, ['이름', '요일', '실적']]

    이름   요일   실적
0  홍길동  월요일  100
1  홍길동  화요일   70
2  홍길동  수요일   80
3  홍길동  목요일   85
4  홍길동  금요일   65
5  홍길동  토요일   95
6  홍길동  일요일  120

In [32]:
df.iloc[:, [2]]

    실적
0  100
1   70
2   80
3   85
4   65
5   95
6  120

In [38]:
df['실적']

0    100
1     70
2     80
3     85
4     65
5     95
6    120
Name: 실적, dtype: int64

In [34]:
df.iloc[:, [0,2]]

    이름   실적
0  홍길동  100
1  홍길동   70
2  홍길동   80
3  홍길동   85
4  홍길동   65
5  홍길동   95
6  홍길동  120

In [40]:
df.iloc[:, [0,1]]

    이름   요일
0  홍길동  월요일
1  홍길동  화요일
2  홍길동  수요일
3  홍길동  목요일
4  홍길동  금요일
5  홍길동  토요일
6  홍길동  일요일

In [58]:
df.loc[df['실적'] >= 80]

    이름   요일   실적
0  홍길동  월요일  100
2  홍길동  수요일   80
3  홍길동  목요일   85
5  홍길동  토요일   95
6  홍길동  일요일  120

In [61]:
df.loc[(df['실적'] >= 80) & (df['실적'] <= 100)]

    이름   요일   실적
0  홍길동  월요일  100
2  홍길동  수요일   80
3  홍길동  목요일   85
5  홍길동  토요일   95

In [65]:
df.loc[(df['실적'] >= 80) & (df['실적'] <= 100), ['이름', '실적']]

    이름   실적
0  홍길동  100
2  홍길동   80
3  홍길동   85
5  홍길동   95